Documents/упКорректировкаОстатковГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упКорректировкаОстатковГСМ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.упОстаткиГСМ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидГСМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыГСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упДополнительноеОборудование</v8:Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/упОстаткиГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>упОстаткиГСМ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияТоплива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыДвиженияТоплива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТопливнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТопливныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упДополнительноеОборудование</v8:Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидГСМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыГСМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/упКорректировкаОстатковГСМ/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда	
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ЕстьБолееПоздниеДокументы(Отказ);
	
	Если НЕ Отказ Тогда
		РеквизитыОбъекта = Новый Структура("Дата, ВидГСМ, ТранспортноеСредство", 
		Дата, ВидГСМ, ТранспортноеСредство);
		
		тбзОстаткиГСМ = упПутевойЛистУчетГСМ.ДельтаГСМ(Количество, Стоимость, СтоимостьНДС, ВидГСМ, ТранспортноеСредство, Дата);		
		ДополнительныеСвойства.Вставить("тбзОстаткиГСМ", тбзОстаткиГСМ);
		
		упПутевойЛистУчетГСМ.СформироватьДвижениеОстаткиГСМ(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ЕстьБолееПоздниеДокументы(Отказ);
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура ЕстьБолееПоздниеДокументы(Отказ)
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.упОстаткиГСМ");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("ТранспортноеСредство", ТранспортноеСредство);
	ЭлементБлокировки.УстановитьЗначение("ВидГСМ", ВидГСМ);
	
	Попытка
		БлокировкаДанных.Заблокировать();
	Исключение
		Отказ = Истина;
		Возврат;
	КонецПопытки;
	
	Отказ = НЕ упПутевойЛистУчетГСМ.ЭтоПоследнийДокументИзменявшийОстаткиГСМ(Ссылка, Дата, ТранспортноеСредство, ВидГСМ);
	
	Если Отказ Тогда
		ТекстСообщения = Нстр("ru = 'Существуют более поздние документы изменяющие остатки ГСМ.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 
	
#КонецЕсли
